Revit 2026 API

# ConnectorAssignedFlowFactor Property

---

The assigned flow factor of this connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AssignedFlowFactor { get; set; }
```
```vb
Public Property AssignedFlowFactor As Double
	Get
	Set
```
```cpp
public:
property double AssignedFlowFactor {
	double get ();
	void set (double value);
}
```
```fsharp
member AssignedFlowFactor : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when get assigned flow factor from a connector not in family instance. Thrown when the connector's domain is not DomainHvac or DomainPiping. |
| ArgumentException | Throw when set an invalid value. |
| InvalidOperationException | Thrown on failure to get or set assigned flow factor. |

Assigned flow factor may be assigned for connectors of some family instances. In order to set this property, it must be mapped to a writable instance parameter in the family definition.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace